Revit 2027 API
DockablePaneState.MinimumHeight Property
 When %dockPosition% is anything other than floating, the minimum height to use for the pane. Default is 200 pixels.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int MinimumHeight { get; set; }
Public Property MinimumHeight As Integer
	Get
	Set
public:
property int MinimumHeight {
	int get ();
	void set (int value);
}
member MinimumHeight : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for minimumHeight is not positive.
See Also
Reference
DockablePaneState Class
Autodesk.Revit.UI Namespace